src/InformationRegisters/ЖурналМониторинга/ЖурналМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналМониторинга</name>
  <resources>
    <name>Этап</name>
    <type>
      <types>EnumRef.ЭтапыОперацийМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполненСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>КлючеваяОперация</name>
    <type>
      <types>CatalogRef.КлючевыеОперацииМониторинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
      <types>CatalogRef.Хранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиУниверсальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиНачалоДня</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПодпискиНаМониторинг/ПодпискиНаМониторинг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодпискиНаМониторинг</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМониторинга</name>
    <type>
      <types>CatalogRef.ВидыМониторинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ЭтапыОперацийМониторинга/ЭтапыОперацийМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыОперацийМониторинга</name>
  <enumValues>
    <name>Начало</name>
  </enumValues>
  <enumValues>
    <name>Завершение</name>
  </enumValues>
  <enumValues>
    <name>ЗамерВремени</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/Мониторинг/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////////////////////////
// Методы для реализации мониторинга системы
//  
//////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьНачалоОперации(КлючеваяОперация, Идентификатор = Неопределено, Комментарий = "") Экспорт
	
	ЗаписатьМониторингОперации(
		КлючеваяОперация,
		Идентификатор,
		Перечисления.ЭтапыОперацийМониторинга.Начало,
		Комментарий);
	
КонецПроцедуры

Процедура ЗаписатьЗавершениеОперации(КлючеваяОперация, Идентификатор = Неопределено, Комментарий = "", ВыполненСОшибкой = Ложь) Экспорт
	
	ЗаписатьМониторингОперации(
		КлючеваяОперация,
		Идентификатор,
		Перечисления.ЭтапыОперацийМониторинга.Завершение,
		Комментарий,
		ВыполненСОшибкой);
	
КонецПроцедуры

Процедура ЗаписатьМониторингОперации(КлючеваяОперация, Идентификатор = Неопределено, Этап = Неопределено, Комментарий = "", ВыполненСОшибкой = Ложь, Значение = 0) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ЖурналМониторинга.СоздатьНаборЗаписей();

	Запись = НаборЗаписей.Добавить();	
	Запись.КлючеваяОперация = КлючеваяОперация;
	Запись.Идентификатор = Идентификатор;
	Запись.ДатаЗаписиУниверсальная = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Запись.НомерСеанса = НомерСеансаИнформационнойБазы();
	Запись.Этап = Этап;
	Запись.ДатаЗаписи = МестноеВремя(Дата(1,1,1) + Запись.ДатаЗаписиУниверсальная/1000);
	Запись.ДатаЗаписиНачалоДня = НачалоДня(Запись.ДатаЗаписи);
	Запись.Комментарий = Комментарий;
	Запись.ВыполненСОшибкой = ВыполненСОшибкой;
	Запись.Значение = Значение;
	
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры

Функция ПользователиПоВидуМониторинга(ВидМониторинга) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодпискиНаМониторинг.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.ПодпискиНаМониторинг КАК ПодпискиНаМониторинг
		|ГДЕ
		|	ПодпискиНаМониторинг.ВидМониторинга = &ВидМониторинга";
	
	Запрос.УстановитьПараметр("ВидМониторинга", ВидМониторинга);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
